Repository: KDE/okteta
Catalog: po/*/liboktetakasten.po
Languages: ar

# @info:whatsthis
source: If you press the <interface>Copy</interface> button, all strings you selected in the list are copied to the clipboard.
ar: اضغط على زر <interface>نسخ</interface> لكي تُنسخ كل السلاسل التي حددتها في القائمة إلى الحافظة.

# @action:button
source: Show
ar: أظهر

# @info:tooltip
source: Shows the selected string in the view.
ar: اعرض السلسلة المحددة.

# @info:whatsthis
source: If you press the <interface>Go to</interface> button, the string which was last selected is marked and shown in the view.
ar: اضغط على زر <interface>اذهب إلى</interface> لكي تُحدد السلسلة التي حُددت أخيرًا وتُعرض في العرض.

# @action
source: Select
ar: اختر

# @info:tooltip
source: Selects the selected string in the view.
ar: حدد السلسلة المحددة.

# @info
source: No strings extracted.
ar: لا يوجد سلاسل مستخرجة.

# @info
source: 1 string extracted.
ar: اُستخرجت 1 سلسلة.

source: 1 bit
ar: 1 بت

# invalid value (End of file reached)
source: <EOF reached>
ar: <وصل إلى نهاية الملف>

source: Name:
ar: الاسم:

source: Type:
ar: النوع:

source: Value:
ar: القيمة:

source: Size:
ar: الحجم:

# size (elements)
source: %2 (%1 child)
ar: %2 (%1 ابن)

# not all values in this structure are as they should be
source: Validation failed.
ar: فشل التحقق.

# not all values in this structure are as they should be
source: Validation failed: "%1"
ar: فشل التحقق: "%1"

source: %1 bit
ar: %1 بت

# boolean value
source: false
ar: خطأ

# boolean value
source: true
ar: صحيح

# Data type
source: boolean bitfield (%1 bit wide)
ar: حقل بت منطقي (بعرض %1 بت)

# Data type
source: signed bitfield (%1 bit wide)
ar: حقل بت صحيح (بعرض %1 بت)

# Data type
source: unsigned bitfield (%1 bit wide)
ar: حقل بت غير صحيح (بعرض %1 بت)

# boolean value with actual value
source: true (%1)
ar: صحيح (%1)

source: %1 (value not in enum)
ar: %1 (القيمة ليست في enum)

source: enum %1 (%2)
ar: عناصر مجموعة %1 (%2)

source: 0x%1 (no matching flags)
ar: 0x%1 (لا يوجد علامات متطابقة)

source: flag %1 (%2)
ar: علم %1 (%2)

# memory pointer with underlying type
source: %1 pointer
ar: مؤشر %1

# data type
source: bool (1 byte)
ar: منطقي (1 بايت)

# data type
source: signed byte
ar: بايت صحيح

# data type
source: unsigned byte
ar: بايت غير صحيح

# data type
source: char
ar: محرف

# data type
source: bool (2 bytes)
ar: منطقي (2 بايت)

# data type
source: signed short
ar: صحيح قصير

# data type
source: unsigned short
ar: غير صحيح قصير

# data type
source: bool (4 bytes)
ar: منطقي (4 بايت)

# data type
source: signed int
ar: صحيح

# data type
source: unsigned int
ar: غير صحيح

# data type
source: bool (8 bytes)
ar: منطقي (8 بايت)

# data type
source: signed long
ar: صحيح طويل

# data type
source: unsigned long
ar: غير صحيح طويل

# data type
source: float
ar: عدد عشري

# data type
source: double
ar: مزدوج

# data type
source: bitfield
ar: حقل بت

source: invalid type
ar: نوع غير صحيح

source: Non-ASCII char: 0x%1
ar: حرف غير أسكي: 0x%1

source: ASCII char
ar: محرف ASCII

source: ASCII string
ar: سلسلة ASCII

source: EBCDIC char
ar: محرف EBCDIC

source: EBCDIC string
ar: سلسلة EBCDIC

source: Latin1 char
ar: محرف Latin1

source: Latin1 string
ar: سلسلة Latin1

source: End of file reached prematurely
ar: وصل إلى نهاية الملف قبل الأوان

source: UTF16-LE char
ar: محرف UTF16-LE

source: UTF16-BE char
ar: محرف UTF16-BE

source: UTF16-LE string
ar: سلسلة UTF16-LE

source: UTF16-BE string
ar: سلسلة UTF16-BE

source: Value too big: 0x%1
ar: القيمة كبيرة جداً: 0x%1

source: UTF32-LE char
ar: محرف UTF32-LE

source: UTF32-BE char
ar: محرف UTF32-BE

source: UTF32-LE string
ar: سلسلة UTF32-LE

source: UTF32-BE string
ar: سلسلة UTF32-BE

source: UTF8 char
ar: محرف UTF8

source: UTF8 string
ar: سلسلة UTF8

# data type in C/C++, then name
source: struct %1
ar: بنية %1

# data type, then name
source: tagged union %1
ar: اتحاد موسوم %1

# data type in C/C++, then name
source: union %1
ar: اتحاد %1

source: <invalid name>
ar: <اسم غير صالح>

# @title:column
source: Time
ar: الوقت

# @title:column
source: Origin
ar: الأصل

# @title:column
source: Message
ar: الرّسالة

# @title:window
source: About %1
ar: حول %1

# Version version-number
source: Version %1
ar: الإصدار %1

source: License: %1
ar: الترخيص: %1

# @title:tab
source: About
ar: حوْل

# @info:tooltip Send an email to the author
source: Email author %1
ar: البريد الإلكتروني للمؤلف %1

# @title:tab
source: Author
ar: المؤلف

# @title:window
source: License Agreement
ar: اتفاقية الترخيص

# @info:label
source: Installed structures:
ar: الهياكل المثبتة:

# @info:label
source: Used structures:
ar: الهياكل المستخدمة:

# @info:tooltip
source: About
ar: عن

# @action:button
source: Get New Structures…
ar: احصل على هياكل جديدة…

# @action:button
source: Advanced Selection…
ar: تحديد متقدم…

# @title:window
source: Advanced Structures Selection
ar: تحديد متقدم للهياكل

source: Dynamic Structure Definitions
ar: تعريفات الهيكل الديناميكية

source: Structure Definitions
ar: تعريفات الهيكل

# @info:placeholder
source: Search…
ar: ابحث…

# @info:tooltip
source: The base to use when converting unsigned numbers to a string.
ar: الأساس الذي يُستخدم عند تحويل الأعداد غير الصحيحة إلى سلسلة.

# @info:tooltip
source: The base to use when converting signed numbers to a string.
ar: الأساس الذي يُستخدم عند تحويل الأعداد الصحيحة إلى سلسلة.

# @info:tooltip
source: The base to use when converting characters to a value string.
ar: الأساس الذي يُستخدم عند تحويل المحارف إلى سلسلة قيمة.

# @info:tooltip
source: Whether to show the numerical value of chars
ar: إظهار القيمة العددية للمحارف أم لا

# @info:tooltip
source: Whether to format floating point values according to the current locale
ar: تنسيق قيم النقاط العائمة وفقًا للموقع الحالي أم لا

# @info:tooltip
source: Whether to use short type names (i.e. uint32 instead of unsigned int)
ar: استخدام أسماء أنواع قصيرة (مثلاً uint32 بدلًا من unsigned int) أم لا

# @info:tooltip
source: If true, integers being displayed in decimal format will be formatted according to the current locale settings
ar: إذا نعم، فإن الأعداد الصحيحة التي تُعرض بتنسيق عشري تُنسق وفقًا لإعدادات الموقع الحالي.

source: Whether to format integer values according to the current locale
ar: تنسيق قيم الأعداد الصحيحة وفقًا للموقع الحالي أم لا

# @info:tooltip
source: The precision used for converting floating-point numbers to strings (number of decimal digits)
ar: الدقة التي تُستخدم لتحويل أرقام النقطة العائمة إلى سلاسل (عدد الخانات العشرية).

# @label:listbox
source: Byte order
ar: ترتيب البايتات

# @item:inlistbox
source: Big endian
ar: ترتيب البايت كبير

# @item:inlistbox
source: Little endian
ar: ترتيب البايت صغير

# @item:inlistbox
source: Binary
ar: ثنائي

# @item:inlistbox
source: Octal
ar: ثماني

# @item:inlistbox
source: Decimal
ar: عشري

# @item:inlistbox
source: Hexadecimal
ar: ست عشري

source: Byte order:
ar: ترتيب البايت:

source: Big endian
ar: ترتيب البايت كبير

source: Little endian
ar: ترتيب البايت صغير

source: Use short type names
ar: استخدم أسماء أنواع قصيرة

source: Use locale-aware integer formatting
ar: استخدم تنسيق الأعداد الصحيحة وفقًا للموقع

source: Unsigned values:
ar: القيم غير الصحيحة:

source: Signed values:
ar: القيم الصحيحة:

source: Use locale-aware floating-point formatting
ar: استخدم تنسيق النقطة العائمة وفقًا للموقع

source: Floating-point precision:
ar: دقة النقطة العائمة:

source: Show numerical value of chars
ar: اعرض القيمة العددية للمحارف

source: Character value:
ar: قيمة المحرف:

# @title:window
source: Structures
ar: البنى

# name of a data structure
source: Name
ar: الاسم

# type of a data structure
source: Type
ar: النوع

# value of a data structure (primitive type)
source: Value
ar: القيمة

# size of a data structure
source: Size
ar: الحجم

# @info
source: No structure definitions
ar: لا يوجد تعريفات هيكل

# @action:button
source: Validate
ar: تحقّق

# @info:tooltip
source: Validate all structures.
ar: تحقق من كل الهياكل.

# @action:button
source: Script console
ar: وحدة تحكم النصوص البرمجية

# @info:tooltip
source: Open script console.
ar: افتح وحدة تحكم السكربت.

# @action:button
source: Settings
ar: إعدادات

# @info:tooltip
source: Open settings.
ar: إعدادات الفتح.

# @title:tab
source: Value Display
ar: عرض القيمة

# @title:tab
source: Structures management
ar: إدارة الهياكل

# @action:button unlock the starting offset of the current structure
source: Unlock
ar: فكّ القفل

# @info:tooltip
source: Unlock selected structure, i.e. the starting offset is always set to the current cursor position.
ar: افتح قفل الهيكل المحدد، أي أن الإزاحة الأولية تُضبط دائمًا على موقع المؤشر الحالي.

# @action:button unlock the starting offset of the current structure
source: Lock
ar: اقفل

# @info:tooltip
source: Lock selected structure to current offset.
ar: أغلق الهيكل المحدد على الإزاحة الحالية.

# @title:window
source: Structures Script Console
ar: وحدة تحكم سكربت الهياكل

# @label
source: No grouping.
ar: بلا تجميع.

# @label:spinbox number of bytes which are grouped
source: Bytes per Group:
ar: بايتات لكل مجموعة:

# @title:window
source: Bytes per Group
ar: بايتات لكل مجموعة

# @label:spinbox number of bytes which are shown per line
source: Bytes per Line:
ar: العناصر لكل سطر:

# @title:window
source: Bytes per Line
ar: العناصر لكل سطر

# @title:menu
source: &Offset Coding
ar: إ&زاحة الشفرة

# @item:inmenu offset in the hexadecimal format
source: &Hexadecimal
ar: &ست عشري

# @item:inmenu offset in the decimal format
source: &Decimal
ar: عش&ري

# @item:inmenu offset in the octal format
source: &Octal
ar: ثم&اتي

# @title:menu
source: &Value Coding
ar: ترميز الق&يمة

# @item:inmenu encoding of the bytes as values in the hexadecimal format
source: &Hexadecimal
ar: ست عشري

# @item:inmenu encoding of the bytes as values in the decimal format
source: &Decimal
ar: عش&ري

# @item:inmenu encoding of the bytes as values in the octal format
source: &Octal
ar: ثم&اتي

# @item:inmenu encoding of the bytes as values in the binary format
source: &Binary
ar: ثنا&ئي

# @title:menu
source: &Char Coding
ar: ترميز &الحروف

# @option:check
source: Show &Non-printing Chars
ar: أظهر الرموز &غير القابلة للطباعة

# @action:inmenu
source: Set Bytes per Line…
ar: اضبط البايتات لكل سطر…

# @action:inmenu
source: Set Bytes per Group…
ar: اضبط البايتات لكل مجموعة…

# @title:menu
source: &Dynamic Layout
ar: تخطيط &ديناميكي

# @item:inmenu The layout will not change on size changes.
source: &Off
ar: مع&طّلة

source: &Wrap Only Complete Byte Groups
ar: &فقط مجموعات بايت كاملة

source: &On
ar: &يعمل

# @option:check
source: Show &Line Offset
ar: إ&إظهار إنزياح الخط

# @title:menu
source: &Show Values or Chars
ar: &اعرض القيم أو المحارف

# @item:inmenu
source: &Values
ar: ال&قيم

# @item:inmenu
source: &Chars
ar: ال&محارف

# @item:inmenu
source: Values && Chars
ar: القيم والمحارف

# @title:menu
source: &View Mode
ar: نمط ال&عرض

# @item:inmenu
source: &Columns
ar: الأع&مدة

# @item:inmenu
source: &Rows
ar: ال&صفوف

# @title:menu submenu to select the view profile or change it
source: View Profile
ar: اعرض الملف الشخصي

# @action:inmenu create a new view profile
source: Create New…
ar: أنشئ جديد...

# @action:inmenu save changed to the view profile to the base profile
source: Save Changes
ar: احفظ التّغييرات

# @action:inmenu reset settings back to those of the saved base profile
source: Reset Changes
ar: صفّر التغييرات

# @title:window
source: New View Profile
ar: تشكيلة عرض جديدة

# @label:textbox
source: Title:
ar: العنوان:

# @title:group
source: Display
ar: العرض

# @option:check
source: Show line offset:
ar: ا&عرض إزاحة السطر:

# @item:inmenu offset in the hexadecimal format
source: Hexadecimal
ar: ست عشري

# @item:inmenu offset in the decimal format
source: Decimal
ar: عشري

# @item:inmenu offset in the octal format
source: Octal
ar: ثماني

# @label:listbox
source: Offset coding:
ar: إزاحة الشفرة:

# @item:inmenu
source: Values
ar: القيم

# @item:inmenu
source: Chars
ar: المحارف

# @item:inmenu
source: Values & Chars
ar: القيم والمحارف

# @option:check
source: Show values or chars:
ar: اعرض القيم أو المحارف:

# @label:listbox
source: Show with rows or columns:
ar: اعرض بالأسطر أو الأعمدة:

# @item:inmenu
source: Columns
ar: الأعمدة

# @item:inmenu
source: Rows
ar: الصفوف

# @title:group
source: Layout
ar: التخطيط

# @item:inmenu The layout will not change on size changes.
source: Off
ar: مغلق

source: Wrap Only Complete Byte Groups
ar: فقط مجموعات بايت كاملة

source: On
ar: يعمل

# @label:listbox
source: Break lines:
ar: كسر الأسطر:

# @item
source: No Grouping
ar: بلا تجميع

# @label:spinbox number of bytes which are grouped
source: Bytes per group:
ar: بايتات لكل مجموعة:

# @label:spinbox number of bytes which are shown per line
source: Bytes per line:
ar: بايت لكل سطر:

# @title:group
source: Values
ar: القيم

# @item:inmenu encoding of the bytes as values in the hexadecimal format
source: Hexadecimal
ar: ست عشري

# @item:inmenu encoding of the bytes as values in the decimal format
source: Decimal
ar: عشري

# @item:inmenu encoding of the bytes as values in the octal format
source: Octal
ar: ثماني

# @item:inmenu encoding of the bytes as values in the binary format
source: Binary
ar: ثنائي

# @label:listbox
source: Coding:
ar: الشفرة:

# @title:group
source: Chars
ar: المحارف

# @label:chooser
source: Char for non-printable bytes:
ar: حرف البايتات غير القابلة للطباعة:

# @label:chooser
source: Char for undefined bytes:
ar: حرف البايتات غير المعرفة:

# @action:inmenu
source: Manage View Profiles…
ar: إدارة تشكيلات العرض…

# @title:window
source: View Profiles
ar: اعرض التشكيلات

# @action:button
source: &Create New…
ar: أ&نشئ جديدًا…

# @info:tooltip
source: Opens an editor for a new view profile.
ar: يفتح محرراً لتشكيلة عرض جديدة.

# @info:whatsthis
source: If you press the <interface>Create New…</interface> button, an editor is opened where you can create and edit a new view profile. The values will be based on the ones of the view profile you selected in the list.
ar: اضغط على زر <interface>أنشئ جديد…</interface> لكي يُفتح محرر حيث يمكنك إنشاء وتعديل تشكيلة عرض جديدة. القيم ستستند إلى قيم تشكيلة العرض التي حددتها في القائمة.

# @action:button
source: &Edit…
ar: &حرِّر…

# @info:tooltip
source: Opens an editor for the view profile.
ar: يفتح محرراً لتشكيلة العرض.

# @info:whatsthis
source: If you press the <interface>Edit…</interface> button, an editor will be opened for the view profile you selected in the list.
ar: اضغط على زر <interface>حرر…</interface> لكي يُفتح محرر لتشكيلة العرض التي حددتها في القائمة.

# @action:button
source: &Set as Default
ar: ا&ضبطها كمبدئيّة

# @info:tooltip
source: Sets the selected view profile as default for all views.
ar: يضبط تشكيلة العرض المحددة كمبدئي لكل العروض.

# @info:whatsthis
source: If you press the <interface>Set as Default</interface> button, the view profile you selected in the list is set as default for all views.
ar: اضغط على زر <interface>اضبط كمبدئي</interface> لكي تُضبط تشكيلة العرض التي حددتها في القائمة كمبدئي لكل العروض.

# @action:button
source: &Delete
ar: ا&حذف

# @info:tooltip
source: Deletes the selected view profile.
ar: حذف تشكيلة العرض المحددة.

# @info:whatsthis
source: If you press the <interface>Delete</interface> button, the view profile you selected in the list is deleted.
ar: اضغط على زر <interface>احذف</interface> لكي تُحذف تشكيلة العرض التي حددتها في القائمة.

source: Modification of %1
ar: تعديل لـ %1

# @title:window
source: "%1" View Profile
ar: التشكيلة العرض "%1"

# @info:status short for: Insert mode
source: INS
ar: يدرج

# @info:status short for: Overwrite mode
source: OVR
ar: يطمس

# @info:tooltip
source: Insert mode
ar: نمط الإدخال

# @info:tooltip
source: Overwrite mode
ar: نمط الطمس

# @info:tooltip
source: Coding of the value interpretation in the current view.
ar: ترميز تفسير القيمة في العرض الحالي.

# @info:tooltip
source: Encoding in the character column of the current view.
ar: الترميز في عمود المحرف من العرض الحالي.

source: Offset: %1
ar: الإزاحة: %1

source: %1 bytes
ar: %1 بايت

# @info:status selection: start offset - end offset ()
source: Selection: %1 - %2 (%3)
ar: التحديد: %1 - %2 (%3)

# @info:status offset value not available
source: Offset: -
ar: الإزاحة: -

# @info:status offset value not available
source: Selection: -
ar: المحدد: -

# @info:status selection: start offset - end offset (number of bytes)
source: Selection: %1 - %2 (%3)
ar: التحديد: %1 - %2 (%3)

# name of the data type
source: Byte Array
ar: جدول الأثمونات

# The byte array was new created.
source: New created.
ar: إنشاء جديد

# numbered title for a created document without a filename
source: [New Byte Array]
ar: [جدول أثمون جديد %1]

# origin of the byte array
source: Created from data.
ar: أُنشئ من بيانات.

# destination of the byte array
source: Loaded from file.
ar: تحميل من الملف

source: There is not enough free working memory to load this file.
ar: لا يوجد ما يكفي من ذاكرة العمل الخالية لتحميل هذا الملف.

source: Support to load files larger than 2 GiB has not yet been implemented.
ar: دعم تحميل الملفات الأكبر من 2 غيغابايت لم ينفذ بعد.

# name of the generated data
source: Pattern…
ar: النمط…

# @item
source: Pattern Inserted
ar: أُدرِج نمط

# @label:textbox
source: Pattern:
ar: النّمط:

# @info:whatsthis
source: Enter a pattern to search for, or select a previous pattern from the list.
ar: أدخل النص الذي تريد البحث عنه ،أو حدد نمطا سابقا من القائمة.

# @label:spinbox number of times to insert the pattern
source: &Number:
ar: ال&عدد:

# @info:whatsthis
source: Enter the number of times the pattern should be inserted.
ar: أدخل عدد المرات التي ينبغي إدراج النمط فيها.

# @item name of the generated data
source: Pattern
ar: النسق

# name of the generated data
source: Random Data…
ar: بيانات عشوائية…

# @item
source: RandomData Inserted
ar: أُدرجت بيانات عشوائية

# @label:spinbox size of the bytearray to generate
source: &Size (bytes):
ar: ال&حجم (بايت):

# @info:whatsthis
source: Enter the size of the bytearray to generate.
ar: أدخل حجم مصفوفة البايت التي ستنشأ.

# @item name of the generated data
source: Random Data
ar: بيانات عشوائية

# name of the generated data
source: Sequence
ar: تسلسل

# @item
source: Sequence Inserted
ar: أُدرج تسلسل

# name of the encoding target
source: bzip2
ar: بزيب2

# @label:spinbox bzip2
source: Block size:
ar: حجم الكتلة:

source: %1 kB
ar: %1 ك.بايت

source: Internal bzip2 error: %1
ar: خطأ bzip2 داخلي: %1

source: Error code %1
ar: رمز الخطأ: %1

source: Internal zlib error when compressing: %1
ar: خطأ zlib داخلي عند الضغط: %1

source: Error writing to output: %1
ar: خطأ في الكتابة إلى المخرجات: %1

# name of the encoding target
source: deflate
ar: تقلص

# @label:spinbox
source: Compression level:
ar: مستوى الضّغط:

# @item:inmenu compression level
source: Default
ar: المبدئيّ

# @label:listbox
source: Compression strategy:
ar: استراتيجية الضغط:

# @item:inmenu compression strategy
source: Default
ar: المبدئيّ

# @item:inmenu compression strategy
source: Filter
ar: المرشّح

# @item:inmenu compression strategy
source: Huffman Encoding Only
ar: ترميز هوفمان فقط

# @item:inmenu compression strategy
source: Run-Length Encoding
ar: ترميز وفق طول التتابع

# @item:inmenu compression strategy
source: Fixed Huffman Encoding
ar: ترميز هوفمان ثابت

# @option:check Create deflate stream without headers or footers
source: Create raw variant:
ar: أنشئ نوعًا خامًا:

source: Internal zlib error: %1
ar: خطأ zlib داخلي: %1

source: Unknown zlib error, code %1
ar: خطأ zlib مجهول، الرمز %1

# name of the encoding target
source: gzip
ar: جي زيب

# @label:textbox
source: File name:
ar: اسم الملفّ:

# @label:textbox
source: Comment:
ar: التعليق:

source: Error writing to underlying device: %1
ar: خطأ في الكتابة إلى الجهاز الأساسي: %1

# @label:spinbox
source: Compression preset level:
ar: مستوى الضغط المسبق:

# @item:inmenu compression preset level
source: Default
ar: المبدئيّ

# @option:check Use extreme variant of compression preset level
source: Use extreme variant:
ar: استخدم نوعًا متطرفًا:

# @label:listbox
source: Integrity check:
ar: فحص السلامة:

# @item:inmenu integrity check
source: None
ar: لا شيء

source: Could not initialize lzma stream.
ar: لا يوجد تهيئة لتدفق lzma.

source: Unknown lzma error, code %1
ar: خطأ lzma مجهول، الرمز %1

source: Internal lzma error when compressing: %1
ar: خطأ lzma داخلي عند الضغط: %1

# @option:check
source: Content size in frame header:
ar: حجم المحتوى في ترويسة الإطار:

# @option:check
source: Content checksum at frame end:
ar: المجموع الاختباري للمحتوى عند نهاية الإطار:

source: Could not create zstd stream context.
ar: لا يوجد إنشاء لـ zstd stream context.

source: Internal zstd error on setup: %1
ar: خطأ zstd داخلي في الإعداد: %1

source: Unknown zstd error, code %1
ar: خطأ zstd مجهول، الرمز %1

source: Internal zstd error when compressing: %1
ar: خطأ zstd داخلي عند الضغط: %1

# @label:listbox the type of the used encoding: Classic, Base32hex or z-base-32.
source: Encoding:
ar: الترميز:

# @info:tooltip
source: The preview uses maximally the first 100 bytes.
ar: المعاينة تستخدم على الأكثر أول 100 بايت.

# name of the encoding target
source: Characters
ar: المحارف

# @label:listbox
source: Non-printable encode mode:
ar: وضع الترميز غير القابل للطباعة:

# @item:inmenu encode mode
source: Substitute
ar: استبدال

# @item:inmenu encode mode
source: Escape C-Style
ar: تهرب بأسلوب C

# @label:listbox
source: Encoding for escaped chars:
ar: ترميز للمحارف المهربة:

# @item:inmenu escape value encoding
source: Hexadecimal
ar: نظام ست عشري

# @item:inmenu escape value encoding
source: Octal
ar: نظام الثماني

# @label:listbox the size in bits of the addresses.
source: Address size:
ar: حجم العنوان:

# @item:inmenu address size
source: 32-bit
ar: 32-بت

# @item:inmenu address size
source: 16-bit
ar: 16-بت

# @item:inmenu address size
source: 8-bit
ar: 8-بت

# name of the encoding target
source: C Array
ar: مصفوفة C

# @label:textbox name of the created variable
source: Name of variable:
ar: اسم المتغير:

# @label:textbox to define after how many items the list is wrapped
source: Items per line:
ar: العناصر لكل سطر:

# @label:listbox the type of the data: char, integer, etc.
source: Data type:
ar: نوع البيانات:

source: Unsigned as hexadecimal:
ar: غير صحيح كست عشري:

# @item:inmenu address size
source: 24-bit
ar: 24-بت

# @label:textbox file name internally given to the encoded data
source: Internal name of file:
ar: الاسم الداخلي للملف:

# @label:listbox the type of the used encoding: historical or Base64.
source: Encoding:
ar: الترميز:

# @item:inmenu Doing the uuencoding using the historical encoding
source: Historical
ar: تاريخي

# name of the encoding target
source: Values
ar: القيم

source: Value coding:
ar: ترميز الق&يمة:

# @label:textbox substring which separates the values
source: Separation:
ar: الفاصلة:

# @label:textbox substring which prefixes each value
source: Prefix:
ar: البادئة:

# @label:textbox substring which postfixes each value
source: Postfix:
ar: التابعة:

# name of the encoding target
source: View in HTML
ar: اعرض في HTML

# name of the encoding target
source: View in Plain Text
ar: عرض بالكتابة الواضحة

# @item:inlistbox coding of offset in the hexadecimal format
source: Hex
ar: ست

# @item:inlistbox coding of offset in the decimal format
source: Dec
ar: عش

# @item:inlistbox coding of offset in the octal format
source: Oct
ar: ثماني

# @item:inlistbox coding of offset in the expression format
source: Expr
ar: تعبير نمطي

# @item:inlistbox coding of the bytes as values in the hexadecimal format
source: Hex
ar: ست

# @item:inlistbox coding of the bytes as values in the decimal format
source: Dec
ar: عشر

# @item:inlistbox coding of the bytes as values in the octal format
source: Oct
ar: ثمن

# @item:inlistbox coding of the bytes as values in the binary format
source: Bin
ar: ثن

# @item:inlistbox coding of the bytes as characters with the values
source: Char
ar: محر
