Repository: KDE/okteta
Catalog: po/*/liboktetakasten.po
Languages: ar

# NAME OF TRANSLATORS
source: Your names
ar: يونس بوطيور

# EMAIL OF TRANSLATORS
source: Your emails
ar: niceboy120@gmail.com

# @title:window
source: File Info
ar: معلومات الملف

# @label
source: Type:
ar: النوع:

# @label
source: Location:
ar: المكان:

# @label
source: Size:
ar: الحجم:

# @label
source: Created/Loaded:
ar: أنشئ/محمل:

# @label
source: Last modified:
ar: آخر تعديل:

# @label
source: Last synchronized:
ar: آخر مزامنة:

# @label
source: Created:
ar: أُنشئ في:

# There is no storage location assigned to yet.
source: [None]
ar: [لا يوجد]

# @option:check
source: Overwrite only
ar: الطمس فقط

# @title:column offset of the bookmark
source: Offset
ar: الإزاحة

# @title:column title of the bookmark
source: Title
ar: العنوان

# @action:inmenu
source: Remove Bookmark
ar: احذف العلامة

# @action:inmenu
source: Remove All Bookmarks
ar: احذف جميع العلامات

# @action:inmenu
source: Go to Next Bookmark
ar: انتقل إلى العلامة التّالية

# @action:inmenu
source: Go to Previous Bookmark
ar: انتقل إلى العلامة السّابقة

# default name of a bookmark
source: Bookmark
ar: علامة

# @title:window
source: Bookmarks
ar: العلامات

# @info
source: No bookmarks
ar: لا علامات مواقع

# @action
source: Create New
ar: أنشئ جديدًا

# @info:tooltip
source: Creates a new bookmark for the current cursor position.
ar: إنشاء علامة جديدة لموقع المؤشر الحالي.

# @info:whatsthis
source: If you press this button, a new bookmark will be created for the current cursor position.
ar: اضغط على هذا الزر لإنشاء علامة جديدة لموقع المؤشر الحالي.

# @action
source: Delete
ar: احذف

# @info:tooltip
source: Deletes all the selected bookmarks.
ar: حذف كل العلامات المحددة.

# @info:whatsthis
source: If you press this button, all bookmarks which are selected will be deleted.
ar: اضغط على هذا الزر لحذف كل العلامات المحددة.

# @action
source: Go to Offset
ar: انتقل إلى الإزاحة

# @info:tooltip
source: Moves the cursor to the selected bookmark.
ar: نقل المؤشر إلى العلامة المحددة.

# @info:whatsthis
source: If you press this button, the cursor is moved to the position of the bookmark which has been last selected.
ar: اضغط على هذا الزر لنقل المؤشر إلى موقع العلامة التي حددتها أخيراً.

# @action
source: Rename
ar: أعد التّسمية

# @info:tooltip
source: Enables renaming of the selected bookmark.
ar: تمكين إعادة تسمية العلامة المحددة.

# @info:whatsthis
source: If you press this button, the name of the bookmark which was last selected can be edited.
ar: اضغط على هذا الزر لتعديل اسم العلامة التي حددتها أخيراً.

# @action
source: Copy Offset
ar: انسخ الإزاحة

# @info:tooltip
source: Copies the offset to the clipboard.
ar: نسخ الإزاحة إلى الحافظة.

# @info:tooltip
source: Character not defined.
ar: حرف غير معرّف.

# @title:column short for Decimal
source: Dec
ar: ست

# @title:column short for Hexadecimal
source: Hex
ar: ست

# @title:column short for Octal
source: Oct
ar: ثمن

# @title:column short for Binary
source: Bin
ar: ثن

# @title:column short for Character
source: Char
ar: محر

# @info:tooltip column contains the value in decimal format
source: Decimal
ar: عشري

# @info:tooltip column contains the value in hexadecimal format
source: Hexadecimal
ar: ست عشري

# @info:tooltip column contains the value in octal format
source: Octal
ar: ثماني

# @info:tooltip column contains the value in binary format
source: Binary
ar: ثنائي

# @info:tooltip column contains the character with the value
source: Character
ar: محرف

# @title:window
source: Value/Char Table
ar: جدول القيمة/الحرف

# @item
source: Inserted 1 Byte
ar: أُدرج 1 بايت

# @info
source: 1 byte inserted.
ar: أُدرج 1 بايت.

# @label:spinbox number of bytes to insert
source: Number (bytes):
ar: العدد (بالبايت):

# @info:tooltip
source: Number of repeats of the currently selected byte in the table to be inserted.
ar: عدد مرات تكرار البايت المحدد حاليًا في الجدول لكي يُدرج.

# @info:tooltip
source: Insert the currently selected byte in the table repeated the given number of times.
ar: أدرج البايت المحدد حاليًا في الجدول مكررًا العدد المحدد من المرات.

# @title:window of the tool to convert between charsets
source: Charset Conversion
ar: تحويل مجموعة المحارف

# @item Converted from charset 1 to charset 2
source: %1 to %2
ar: %1 إلى %2

# @title:window
source: Charset Conversion
ar: تحويل مجموعة المحارف

# @item:inmenu Is converted _from_ charset (selected in combobox next to this)
source: From
ar: من

# @item:inmenu Is converted _to_ charset (selected in combobox next to this)
source: To
ar: إلى

# @info:tooltip
source: The direction the bytes are converted, to or from the selected charset.
ar: اتجاه تحويل البايتات، إلى أو من مجموعة المحارف المحددة.

# @info:whatsthis
source: Select the direction the bytes are converted, to or from the selected charset.
ar: حدد اتجاه تحويل البايتات، إلى أو من مجموعة المحارف المحددة.

# @info:tooltip
source: The charset the bytes are converted to.
ar: مجموعة المحارف التي تُحول إليها البايتات.

# @info:whatsthis
source: Select the charset the bytes are converted to.
ar: حدد مجموعة المحارف التي تُحول إليها البايتات.

# @option:check substitute bytes whose char is not part of the target charset
source: Substitute missing:
ar: استبدل المفقود:

# @info:tooltip
source: Selects if bytes should be substituted with a default byte if its char in the source charset is not part of the target charset.
ar: حدد إن كان ينبغي استبدال البايتات ببايت مبدئي إذا كان حرفها في مجموعة المحارف المصدر ليس جزءًا من مجموعة المحارف الهدف.

# @info:whatsthis
source: Set to true if bytes should be substituted with a default byte if its char in the source charset is not part of the target charset.
ar: اضبط على نعم إذا كان ينبغي استبدال البايتات ببايت مبدئي إذا كان حرفها في مجموعة المحارف المصدر ليس جزءًا من مجموعة المحارف الهدف.

# @label:textbox byte to use for chars which are not part of the target charset
source: Substitute byte:
ar: بايت الاستبدال:

# @info:tooltip
source: The byte to use for chars which are not part of the target charset.
ar: البايت الذي يُستخدم للمحارف التي ليست جزءًا من مجموعة المحارف الهدف.

# @info:whatsthis
source: Define the byte to use for chars which are not part of the target charset.
ar: حدد البايت الذي يُستخدم للمحارف التي ليست جزءًا من مجموعة المحارف الهدف.

# @action:button
source: Convert
ar: حوّل

# @info:tooltip
source: Converts the bytes in the selected range.
ar: حول البايتات في النطاق المحدد.

# @info:whatsthis
source: If you press the <interface>Convert</interface> button, all bytes in the selected range will be replaced by bytes which represent the same character in the selected target charset.
ar: اضغط على زر <interface>حوّل</interface> لكي تُستبدل كل البايتات في النطاق المحدد ببايتات تُمثل الحرف نفسه في مجموعة المحارف الهدف المحددة.

# @info
source: No bytes converted.
ar: لا يوجد بايتات محولة.

# @info
source: 1 byte converted.
ar: حُولت 1 بايت.

# @info
source: No bytes substituted.
ar: لا يوجد بايتات مستبدلة.

# @info
source: 1 byte substituted.
ar: اُستبدل 1 بايت.

# @info
source: Conversion cancelled because of chars which are not in the target charset.
ar: أُلغي التحويل بسبب محارف ليست في مجموعة المحارف الهدف.

# @title:window of the tool to calculate checksums
source: Checksum
ar: المجموع

# @label:listbox algorithm to use for the checksum
source: Algorithm:
ar: الخوارزمية:

# @info:whatsthis
source: Select the algorithm to use for the checksum.
ar: حدد الخوارزمية التي تستخدم لحساب المجموع الاختباري.

# @action:button calculate the checksum
source: &Calculate
ar: ا&حسب

# @info:tooltip
source: Calculate the checksum for the bytes in the selected range.
ar: احسب المجموع الاختباري للبايتات في النطاق المحدد.

# @info:whatsthis
source: If you press the <interface>Calculate</interface> button, the list will be updated to all strings which are contained in the selected range and have the set minimum length.
ar: اضغط على زر <interface>احسب</interface> لكي يُحدث القائمة بجميع السلاسل التي تحتويها النطاق المحدد وتملك الحد الأدنى للطول.

# @info:placeholder
source: No checksum calculated yet.
ar: لم يحسب مجموع اختباري بعد.

# @action:inmenu
source: Crop
ar: اقتصّ

# @item name of the change
source: Crop
ar: اقتصّ

# @title:window
source: Binary Filter
ar: المرشح الثنائي

# @info
source: 1 byte filtered with %2.
ar: نُخل 1 بايت بـ %2.

# @label:listbox operation to use by the filter
source: Operation:
ar: العملية:

# @info:tooltip
source: The operation to use for the filter.
ar: العملية التي تُستخدم للمرشح.

# @info:whatsthis
source: Select the operation to use for the filter.
ar: حدد العملية التي تُستخدم للمرشح.

# @action:button
source: &Filter
ar: ر&شِّح

# @info:tooltip
source: Executes the filter for the bytes in the selected range.
ar: نفّذ المرشح على البايتات في النطاق المحدد.

# @info:whatsthis
source: If you press the <interface>Filter</interface> button, the operation you selected above is executed for the bytes in the selected range with the given options.
ar: اضغط على زر <interface>المرشح</interface> لكي تُنفذ العملية التي حددتها أعلاه على البايتات في النطاق المحدد بالخيارات المعطاة.

# @action:inmenu
source: &Go to Offset…
ar: ا&نتقل إلى الإزاحة…

# @title:window of the tool to set a new offset for the cursor
source: Goto
ar: انتقل إلى

# @label:listbox
source: O&ffset:
ar: الإ&زاحة:

# @info:whatsthis
source: Enter an offset to go to, or select a previous offset from the list.
ar: أدخل إزاحة لتذهب إليها، أو حدد إزاحة سابقة من القائمة.

# @option:check
source: From c&ursor
ar: من ال&مؤشر

# @info:whatsthis
source: Go relative from the current cursor location and not absolute.
ar: اذهب بإزاحة نسبية من موقع المؤشر الحالي وليس إزاحة مطلقة.

# @option:check
source: &Extend selection
ar: مدد التحديد

# @info:whatsthis
source: Extend the selection by the cursor move.
ar: مدد التحديد بتحريك المؤشر.

# @option:check
source: &Backwards
ar: لل&خلف

# @info:whatsthis
source: Go backwards from the end or the current cursor location.
ar: اذهب للخلف من النهاية أو من موقع المؤشر الحالي.

# @action:button
source: &Go
ar: ا&ذهب

# @info:tooltip
source: Go to the Offset
ar: انتقل إلى الإزاحة

# @info:whatsthis
source: If you press the <interface>Go</interface> button, the cursor will be moved in the document to or, on your option, by the offset you entered above.
ar: اضغط على زر <interface>اذهب</interface> لكي يُنقل المؤشر في المستند إلى، أو، حسب خيارك، بالإزاحة التي أدخلتها أعلاه.

# @title:window
source: Statistics
ar: الإحصائيات

# @label size of selected bytes
source: Size:
ar: الحجم:

# @info:tooltip
source: The number of the bytes the statistic was built for.
ar: عدد البايتات التي بُني الإحصاء من أجلها.

# @action:button build the statistic of the byte frequency
source: &Build
ar: ا&بنِ

# @info:tooltip
source: Builds the byte frequency statistic for the bytes in the selected range.
ar: يبني إحصاء تردد البايتات للبايتات في النطاق المحدد.

# @info:whatsthis
source: If you press the <interface>Build</interface> button, the byte frequency statistic is built for the bytes in the selected range.
ar: اضغط على زر <interface>ابن</interface> لكي يُبنى إحصاء تردد البايتات للبايتات في النطاق المحدد.

# @action:button
source: Copy
ar: انسخ

# @info:tooltip
source: Copies the selected statistic lines to the clipboard.
ar: نسخ أسطر الإحصاء المحددة إلى الحافظة.

# @info:whatsthis
source: If you press the <interface>Copy</interface> button, all statistic lines you selected in the list are copied to the clipboard.
ar: اضغط على زر <interface>انسخ</interface> لكي تُنسخ كل أسطر الإحصاء التي حددتها في القائمة إلى الحافظة.

source: 1 byte
ar: لا بايتات

# @title:column count of characters
source: Count
ar: العدد الإجمالي للحرف

# @title:column Percent of byte in total
source: Percent
ar: النسبة المئوية

# name of the checksum algorithm
source: Adler-32
ar: أدلر-32

# @label:listbox variant used to select the CRC-64 variant
source: CRC-64 variant:
ar: تنويعة CRC-64:

# @info:tooltip
source: CRC-64 variant used by calculation.
ar: نوع CRC-64 المستخدم في الحساب.

# name of the checksum algorithm
source: Modular sum 16-bit
ar: المجموع المُعاملي 16-بت

# name of the checksum algorithm
source: Modular sum 32-bit
ar: المجموع المُعاملي 32-بت

# name of the checksum algorithm
source: Modular sum 64-bit
ar: المجموع المُعاملي 64-بت

# name of the checksum algorithm
source: Modular sum 8-bit
ar: المجموع المُعاملي 8-بت

# @item:inlistbox
source: Big-endian
ar: ترتيب البايت كبير

# @item:inlistbox
source: Little-endian
ar: ترتيب البايت صغير

# @label:listbox byte order to use for decoding the bytes into integer values
source: Byte Order:
ar: ترتيب البايتات:

# @info:tooltip
source: The byte order to use for decoding the bytes into integer values.
ar: ترتيب البايتات التي تُستخدم لفك ترميز البايتات إلى قيم عددية صحيحة.

# @info
source: No parameters
ar: لا يوجد وسائط

# name of the filter; it does a logic AND operation
source: operand AND data
ar: عملية AND للمعطيات

source: INVERT data
ar: اعكس البيانات

# @label:textbox operand to the arithmetic filter function
source: Operand:
ar: معامل:

# @info:tooltip
source: The operand to do the operation with.
ar: الوسيط الذي تُنفذ به العملية.

# @info:whatsthis
source: Enter an operand, or select a previous operand from the list.
ar: أدخل العملية أو إختر عملية سابقة من اللائحة

# @option:check
source: Align at end:
ar: حاذ عند النهاية:

# @info:tooltip
source: Sets if the operation will be aligned to the end of the data instead of to the begin.
ar: حدد إن كانت العملية ستحاذ عند نهاية البيانات بدلًا من البداية.

# @info:whatsthis
source: If set, the operation will be aligned to the end of the data.
ar: إذا حُدد، فإن العملية ستحاذ عند نهاية البيانات.

# name of the filter; it does a logic OR operation
source: operand OR data
ar: عملية OR على المعلومات

source: REVERSE data
ar: اعكس البيانات

# @option:check
source: Reverse also bits:
ar: اعكس البتات أيضًا:

# @info:whatsthis
source: If set, the bits are arranged in reverse order as well.
ar: إذا حُدد، فإن البتات سترتب بترتيب معكوس أيضًا.

source: ROTATE data
ar: تدوير المعطيات

# @label:spinbox number of bytes the movement is done within
source: &Group size (bytes):
ar: حجم &المجموعة (بالبايت):

# @info:tooltip
source: The number of bytes within which each movement is made.
ar: عدد البايتات التي تُنفذ الحركة ضمنها.

# @info:whatsthis
source: Control the number of bytes within which each movement is made.
ar: تحكم في عدد البايتات التي تُنفذ الحركة ضمنها.

# @label:spinbox width (in number of bits) the bits are moved
source: S&hift width (bits):
ar: عرض &الإزاحة (بالبت):

# @info:tooltip
source: The width of the shift. Positive numbers move the bits to the right, negative to the left.
ar: عرض الإزاحة. الأعداد الموجبة تنقل البتات إلى اليمين، والسالبة إلى اليسار.

# @info:whatsthis
source: Control the width of the shift. Positive numbers move the bits to the right, negative to the left.
ar: التحكم في التأخير, الأعداد الموجبة تحرك البيتات إلى اليمين و الأعداد السالبة تحركها إلى اليسار

# name of the filter; it moves the bits, setting freed ones to zero
source: SHIFT data
ar: SHIFT للمعطيات

# name of the filter; it does a logic XOR operation
source: operand XOR data
ar: عملية XOR للمعطيات

# @label:textbox encoding of one byte as value in the binary format
source: Binary 8-bit
ar: ثنائي 8-بت

# @label:textbox encoding of one byte as character
source: Character 8-bit
ar: محرف 8-بت

# @label:textbox
source: Float 32-bit
ar: عائم 32-بت

# @label:textbox
source: Float 64-bit
ar: عائم 64-بت

# @label:textbox encoding of one byte as value in the hexadecimal format
source: Hexadecimal 8-bit
ar: سداسي عشري 8-بت

# @label:textbox encoding of one byte as value in the octal format
source: Octal 8-bit
ar: ثماني 8-بت

# @label:textbox
source: Signed 16-bit
ar: صحيح 16-بت

# @label:textbox
source: Signed 32-bit
ar: صحيح 32-بت

# @label:textbox
source: Signed 64-bit
ar: صحيح 64-بت

# @label:textbox
source: Signed 8-bit
ar: صحيح 8-بت

# @label:textbox
source: Unsigned 16-bit
ar: غير صحيح 16-بت

# @label:textbox
source: Unsigned 32-bit
ar: غير صحيح 32-بت

# @label:textbox
source: Unsigned 64-bit
ar: غير صحيح 64-بت

# @label:textbox
source: Unsigned 8-bit
ar: غير صحيح 8-بت

# @title:window
source: Find
ar: اعثر

# @info:tooltip
source: Enter the bytes to search for, or select bytes previously searched for from the list.
ar: أدخل البايتات التي تبحث عنها، أو حدد بايتات بُحث عنها سابقًا من القائمة.

# @title:group
source: Options
ar: الخيارات

# @option:check
source: C&ase sensitive
ar: حساس ل&حالة الأحرف

# @info:whatsthis
source: Perform a case sensitive search: entering the pattern 'Joe' will not match 'joe' or 'JOE', only 'Joe'.
ar: أجر بحثا يراعي كبر الأحرف: أي أن النموذج 'Joe' لن يوافق خلال البحث 'joe' أو 'JOE' مثلا،بل فقط 'Joe'.

# @option:check
source: &Whole words only
ar: ال&كلمات الكاملة فقط

# @info:whatsthis
source: Require word boundaries in both ends of a match to succeed.
ar: تطلبْ حدود الكلمة في كلا النهايتين في النتيجة لكي تنجح.

# @info:whatsthis
source: Start searching at the current cursor location rather than at the top.
ar: إبدأ البحث من الموضع الحالي للمؤشر عوض البدء من البداية

# @info:whatsthis
source: Replace backwards.
ar: تعويض إلى الخلف

# @option:check
source: &Selected bytes
ar: الأثم&ونات المنتقاة

# @info:whatsthis
source: Only search within the current selection.
ar: إبحث فقط في المنتقى الحالي

# @option:check set the view into overwrite mode
source: Overwr&ite Mode
ar: وضع الكتابة الفو&قيّة

# @info:whatsthis
source: Choose whether you want the input to be inserted or to overwrite existing data.
ar: اختر إن كنت تريد إدراج المدخلات أو الكتابة فوق البيانات الموجودة.

# @title:window
source: Decoding Table
ar: جدول فك الترميز

# @item Edited as datatype
source: Edited as %1
ar: حرر كـ%1

# @info Edited as datatype
source: Edited as %1
ar: حرر كـ%1

# @title:column name of the datatype
source: Type
ar: النوع

# @title:column value of the bytes for the datatype
source: Value
ar: القيمة

# @info:tooltip for column Type
source: The type of data
ar: نوع البيانات

# @info:tooltip for column Value
source: The value of the bytes for the datatype
ar: قيمة البايتات لنوع البيانات

# @info:tooltip
source: The byte order to use for decoding the bytes.
ar: ترتيب البايتات الذي يُستخدم لفك ترميز البايتات.

# @option:check
source: Unsigned as hexadecimal:
ar: غير صحيح كست عشري:

# @info:tooltip
source: Sets whether the values of the unsigned integer types are shown as hexadecimal instead of as decimal.
ar: حدد إن كانت قيم أنواع الأعداد الصحيحة غير الصحيحة تُعرض كست عشري بدلًا من عشري.

# @info
source: The new value needs <emphasis>fewer</emphasis> bytes (%1 instead of %2).<nl/>Keep the unused bytes or remove them?
ar: القيمة الجديدة تحتاج <emphasis>بايتات أقل</emphasis> (%1 بدلًا من %2).<nl/>أبقِ البايتات غير المستخدمة أم احذفها؟

# @action:button keep the unused bytes
source: &Keep
ar: أ&بقِ

# @info:tooltip
source: Keep the unused bytes with their old values.
ar: أبقِ البايتات غير المستخدمة بقيمها القديمة.

# @info
source: The new value needs <emphasis>more</emphasis> bytes (%1 instead of %2).<nl/>Overwrite the following bytes or insert new ones as needed?
ar: القيمة الجديدة تحتاج <emphasis>بايتات أكثر</emphasis> (%1 بدلًا من %2).<nl/>اكتب فوق البايتات التالية أم أدرج بايتات جديدة حسب الحاجة؟

# @action:inmenu
source: Edit
ar: حرّر

# @action:inmenu
source: Select
ar: اختر

# @title:window
source: Print Byte Array %1
ar: طباعة مصفوفة البايت %1

# @info
source: Could not print.
ar: لا يمكن الطباعة.

# in the header of the printed page, e.g. Page 2 of 20
source: Page %p of %P
ar: صفحة %p من %P

# in the footer of the printed page, e.g. Printed by: Joe User
source: Printed by: %U
ar: طبعه: %U

# @title:window
source: Replace
ar: استبدل

# @info
source: Replace pattern not found in byte array.
ar: نسق التغيير غير موجود في جدول الأثمونات

# @info
source: No replacements made.
ar: لا يوجد استبدال.

# @info
source: 1 replacement made.
ar: لا استبدالات تمّت

# @info
source: End of byte array reached.<nl/>Continue from the beginning?
ar: وصلت إلى نهاية مصفوفة البايت.<nl/>أتريد المتابعة من البداية؟

# @info
source: Beginning of byte array reached.<nl/>Continue from the end?
ar: وصلت إلى بداية مصفوفة البايت.<nl/>أتريد المتابعة من النهاية؟

# @title:window
source: Replace Bytes
ar: استبدل البايت

# @action;button
source: &Replace
ar: ا&ستبدل

# @info:tooltip
source: Start replace
ar: إبدأ التعويض

# @info:whatsthis
source: If you press the <interface>Replace</interface> button, the bytes you entered above are searched for within the byte array and any occurrence is replaced with the replacement bytes.
ar: إذا ضغطتم على زر <interface>استبدل</interface>, سيبحث على الأثمونات (bytes )التي كتبتم فوق و ستعوضها أثمونات التعويض.

# @title:group
source: Replace With
ar: استبدل بـ

# @info:tooltip
source: Enter the bytes to replace with, or select bytes previously replaced with from the list.
ar: أدخل البايتات التي تستبدل بها، أو حدد بايتات استُبدلت بها سابقًا من القائمة.

# @option:check
source: &Prompt on replace
ar: &السؤال عند الاستبدال

# @info:whatsthis
source: Ask before replacing each match found.
ar: إسأل قبل تعويض كل تطابق موجود

# @title:window prompt for iterative replacement
source: Replace
ar: استبدل

# @action:button
source: Replace &All
ar: استبدل الك&ل

# @action:button
source: &Skip
ar: تجاهل

# @action:button
source: Replace
ar: استبدل

# @title
source: Replace
ar: استبدل

# @info
source: Search key not found in byte array.
ar: لم يعثر على مفتاح البحث في مصفوفة البايت.

# @title:window
source: Find Bytes
ar: البحث عن بايتات

# @action:button
source: &Find
ar: ا&عثر

# @info:tooltip
source: Start searching
ar: ابدأ البحث

# @info:whatsthis
source: If you press the <interface>Find</interface> button, the bytes you entered above are searched for within the byte array.
ar: اضغط على زر <interface>البحث</interface> لكي يُبحث عن البايتات التي أدخلتها أعلاه ضمن مصفوفة البايت.

# @title
source: Search
ar: ابحث

# @action:inmenu
source: &Select Range…
ar: &حدد النطاق…

# @title:window of the tool to select a range
source: Select
ar: اختر

# @label:listbox
source: Start offset:
ar: بدء الإزاحة:

# @label:listbox
source: End offset:
ar: نهاية الإزاحة:

# @option:check
source: End relative
ar: النهاية نسبية

# @action:button
source: &Select
ar: ا&ختر

# @info:tooltip
source: Select the range.
ar: حدد النطاق.

# @info:whatsthis
source: If you press the <interface>Select</interface> button, the cursor will be moved in the document to or, on your option, by the offset you entered above.
ar: اضغط على زر <interface>تحديد</interface> لكي يُنقل المؤشر في المستند إلى، أو، حسب خيارك، بالإزاحة التي أدخلتها أعلاه.

# @title:column offset of the extracted string
source: Offset
ar: الإزاحة

# @title:column string extracted from the byte array
source: String
ar: سلسلة

# @title:window of the tool to extract strings
source: Strings
ar: السّلاسل

# @title:window
source: Strings
ar: السّلاسل

# @label:spinbox minimum length for consecutive chars to be seen as a string
source: Minimum length:
ar: الحد الأدنى للطول:

# @action:button extract the strings from the byte array
source: &Extract
ar: ا&ستخراج

# @info:tooltip
source: Finds the strings contained in the selected range and lists them in the view below.
ar: بحث عن السلاسل التي يحتويها النطاق المحدد، وإدراجها في العرض أدناه.

# @info:whatsthis
source: If you press the <interface>Extract</interface> button, the selected range is searched for all strings which have the set minimum length. This strings found will be listed in the view below.
ar: اضغط على زر <interface>استخرج</interface> لكي يُبحث في النطاق المحدد عن كل السلاسل التي تملك الحد الأدنى للطول. السلاسل التي عُثر عليها ستُدرج في العرض أدناه.

# @label:lineedit filter term for displayed strings
source: Filter:
ar: المرشّح:

# @info:placeholder
source: Enter a term to limit the list.
ar: أدخل مصطلحًا لتقييد القائمة.

# @info
source: No strings
ar: لا يوجد سلاسل

# @info:tooltip
source: Copies the selected strings to the clipboard.
ar: نسخ السلاسل المحددة إلى الحافظة.
